methodClient/method_soap_log.txt_countCharactersWrapper_request.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Body>
    <n1:countCharactersWrapper xmlns:n1="http://wrapperMethods">
      <n1:userName>deuce</n1:userName>
      <n1:password>password</n1:password>
      <n1:toCount>this should return 21</n1:toCount>
    </n1:countCharactersWrapper>
  </env:Body>
</env:Envelope>